[{
     "movieId": "m001",
     "movie_title": "Bhool Bhulaiyaa 3",
     "poster": "https://assets-in.bmscdn.com/iedb/movies/images/mobile/thumbnail/xlarge/bhool-bhulaiyaa-3-et00353996-1728474428.jpg",
     "trailer": "https://youtu.be/6YMY62tMLUA?autoplay=1&si=7HnmxKhAMzPqEX8X",
     "rating": 8.0,
     "duration": 155,
     "genre": "Horror, Comedy",
     "language": "Hindi",
     "release_date": "2024-12-25",
     "synopsis": "A suspenseful and humorous journey unfolds as Kartik Aaryan and Vidya Balan return to the haunted palace, uncovering secrets and supernatural encounters.",
     "storyline":"1824 Manjulika is burnt alive by a Maharaja but she returns to take revenge and haunts the palace.Two hundred years later in present time Ruhan cons people as Rooh Baba by assuring to free them from spirits.He has a visitor Meera and her uncle who ask him to accompany them to their palace haunted by Manjulika and promise him huge sum.Upon reaching he realizes that no one lives in the palace fearing the ghost and Meera and her family live in cowshed in poverty.The villagers give Ruhan shocking looks and he realizes from head priest that he is reincarnation of their king who was killed by his sister Manjulika.The village burns Manjulika's statute every year during a festival but this time a mysterious women Mallika enters the palace and claims o be a historian and during her research leads to a secret passage which the head priest asks not to open until Durga Asthami.But Ruhan,Meera and others open the door of secret passage where head priest arrives to tell that more havoc is waiting to come on the palace.As he finds that the king had two sisters who were jealous of him and wanted to kill him.But it's a mystery that who was actually Manjulika who killed him and the havoc arrives in form of Mandira whose waiting to enter the palace.",
     "quality": "HD"
   },
   {
     "movieId": "m002",
     "movie_title": "Singham Again",
     "poster": "https://assets-in.bmscdn.com/iedb/movies/images/mobile/thumbnail/xlarge/singham-again-et00354858-1728569759.jpg",
     "trailer": "https://www.youtube.com/embed/niscuawelGI?autoplay=1&mute=1&rel=0&modestbranding=1&showinfo=0",
     "rating": 7.5,
     "duration": 145,
     "genre": "Action, Drama",
     "language": "Hindi",
     "release_date": "2024-12-15",
     "synopsis": "A fearless and righteous police officer, Singham, is called back into action to tackle a rising criminal empire and ensure justice. This action-packed drama continues the legacy of the iconic franchise.",
     "storyline":"Bajirao Singham currently transferred in Kashmir is attacked by a unknown identity who turns to be Omar Hafiz.He tells him that his arrest is not the end but someone will continue his revenge with more bloodbath.Singham is made head of the Shiva squad and two years later he has just one question what Omar meant during his arrest.A group of smugglers are arrested with huge drug consignment and revel that it belongs to Danger Lanka whom nobody has seen but three men lead the operation.Shakti Shetty a lady Singham cop is assigned to arrest them as the three men are spotted in her jurisdiction but after the arrest three men elope in Shakti's absence when Lanka sets the police station on fire.Avni wife of Singham working on Ramayana project is kidnapped by Lanka during her research but a cop Satya rescues her and takes to his Ashram.Lanka reaches an attacks the Ashram shooting Avni who gets injured and Lanka takes her along.Singham awaits for her whereabouts where Lanka calls him to revel his true identity and tells him that he will revel location of Avni on a condition that Singham along with his fellow cops Sooryavanshi and Simmba will arrive to save Avni from him as he wants to settle old score on the trio.",
     "quality": "HD"
   },
   {
    "movieId": "m003",
    "movie_title": "Pathaan",
    "poster": "https://m.media-amazon.com/images/M/MV5BNDdkNTY1MDQtY2I5MC00OTFlLTg5OWQtZWE2YzE5NWFiMDgzXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/vqu4z34wENw?autoplay=1&si=aJDzOqoVeygEOaD5",
    "rating": 7.8,
    "duration": 146,
    "genre": "Action, Thriller",
    "language": "Hindi",
    "release_date": "2023-01-25",
    "synopsis": "A RAW agent, presumed dead, teams up with others to stop a terrorist attack in India.",
    "storyline":"Indian RAW agent 'Pathaan' (Shah Rukh Khan) gets to know of a major impending attack against India, mounted by a mercenary group led by the ruthless enigma Jim (John Abraham), who has a history of his own. With the doomsday clock ticking away and an agent Rubai (Deepika Padukone) his only possible ally, Pathaan must fight countless betrayals and deal with destruction as he takes on Jim.",
    "quality": "HD"
  },
  {
    "movieId": "m004",
    "movie_title": "RRR",
    "poster": "https://m.media-amazon.com/images/M/MV5BNWMwODYyMjQtMTczMi00NTQ1LWFkYjItMGJhMWRkY2E3NDAyXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/GY4BgdUSpbE?autoplay=1&si=fYlZOR2A3K-2jJoI",
    "rating": 8.3,
    "duration": 182,
    "genre": "Action, Drama",
    "language": "Telugu",
    "release_date": "2022-03-25",
    "synopsis": "A fictional story about two Indian revolutionaries fighting against the British Raj.",
    "storyline":"During the British era, Malli, a small tribal girl, is taken away by British governor Scott Buxton and his wife Catherine against the wishes of her mother. Rama Raju is an Indian cop who works for the British army; for him duty comes first, and he is very ruthless to revolutionary Indians but is never given his due by British government. The British government find that a tribal Komaram Bheem, who considers Malli his sister, has started his search for her and could be an obstacle for the British army. The governor and his wife announce a special post for any officer who can bring Bheem to them. Rama Raju decides to take the matters into his own hands and promises the government to bring him in dead or alive. Bheem by now has reached he city in search of Malli and pretends to be a mechanic, Akhtar. During a train accident on a lake he and Rama Raju risk their lives and save a kid and become best of friends. But each man will clash with the other and will thirst for each other's blood in order to complete their missions.",
    "quality": "HD"
  },
  {
    "movieId": "m005",
    "movie_title": "KGF: Chapter 2",
    "poster": "https://m.media-amazon.com/images/S/pv-target-images/f5a21f64af7359f7aaa7c29dee8a12a97630e707cdbf71e0ae6b063322fb8575.jpg",
    "trailer": "https://www.youtube.com/embed/JKa05nyUmuQ?autoplay=1&si=Lg7j_ssbzFmZ7Vxo",
    "rating": 8.4,
    "duration": 168,
    "genre": "Action, Drama",
    "language": "Kannada",
    "release_date": "2022-04-14",
    "synopsis": "Rocky, a man with a mysterious past, takes control of the gold mines in Kolar, facing ruthless enemies.",
    "storyline":"The blood-soaked land of Kolar Gold Fields (KGF) has a new overlord now - Rocky, whose name strikes fear in the heart of his foes. His allies look up to Rocky as their savior, the government sees him as a threat to law and order; enemies are clamoring for revenge and conspiring for his downfall. Bloodier battles and darker days await as Rocky continues on his quest for unchallenged supremacy.",
    "quality": "HD"
  },
  {
    "movieId": "m006",
    "movie_title": "Laal Singh Chaddha",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTxl2c_cOR2uFTjpOcYtI-3hV7vUjVfJSPmjw&s",
    "trailer": "https://www.youtube.com/embed/R6savS7m0Fg?autoplay=1&si=XzxfySSsprgRV9MW",
    "rating": 6.8,
    "duration": 159,
    "genre": "Drama, Comedy",
    "language": "Hindi",
    "release_date": "2022-08-11",
    "synopsis": "A simple man with a kind heart lives an extraordinary life, shaping the history around him.",
    "storyline":"Laal Singh Chaddha a man with low IQ level is travelling in a train and happens to tell his story to his co passenger with background of current events happening in India finding it interesting more fellow passengers join in.He was born during the Indo Pak war where his grandfather was a martyr hence he was named after him having a low IQ level no school wants to admit him but finally a priest of Catholic school does so seeing the fighting spirit in his mother.The school children try to avoid him but he befriends Roopa Dsouza his his classmate and bonds very well with her but Roopa wants to be rich as her drunkard father always beats her mother for money one day leading to her death.After death of her mother Roopa goes to stay with her grandmother who turns out to be maid working in Lal's house and both start to spend more time together and as kid Lal eventually proposes her.Years later Roopa and Lal study together at a college in Delhi and Lal still has same feelings for her.But Roopa's ambition is to got to Mumbai to be an actress an become rich while Lal joins the Indian army.During his term in army Lal meets Bala an both become good friends and plan a business together but Bala passes away in the war.After his army service Lal decides to full fill dream of Bala and starts the business planned with him where he is assisted by Mohdmmad Paji who was once a terrorist and Lal saved his life during war.Lal's life and business is doing well but he still has a place for Roopa whom he hasn't met since years and waits for return.",
    "quality": "HD"
  },
  {
    "movieId": "m007",
    "movie_title": "Jersey",
    "poster": "https://m.media-amazon.com/images/M/MV5BMWEyMWY1M2UtNGU3OS00YjgzLTk2NjItZWM2Mzk4Yzg2ZDk5XkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/BT0zd0kmTxM?autoplay=1&si=XFKlcVzijP-V8YX6",
    "rating": 7.6,
    "duration": 137,
    "genre": "Sports, Drama",
    "language": "Hindi",
    "release_date": "2022-04-22",
    "synopsis": "A former cricketer, who left the game due to personal issues, returns to the sport for the sake of his son.",
    "storyline":"uck hasn't always been in favour of Arjun, a gifted cricketer in his mid-thirties whose career has failed to take off. With everyone around him insisting that he should give up on his career, will Arjun have the courage of conviction to continue pursuing his dream?",
    "quality": "HD"
  },
  {
    "movieId": "m008",
    "movie_title": "Brahmāstra: Part One – Shiva",
    "poster": "https://m.media-amazon.com/images/M/MV5BMDIxMWZjODAtNmRjOC00OGExLWJjZTAtMmQ1MzRmYjhlNjk3XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/kF5n62A3qxo?autoplay=1&si=JTFaa97gVjEoGqG2",
    "rating": 7.0,
    "duration": 158,
    "genre": "Fantasy, Adventure",
    "language": "Hindi",
    "release_date": "2022-09-09",
    "synopsis": "A young man embarks on a journey to discover the power of his inner energy and fight against evil forces.",
    "storyline":"In ancient India people of Brahmansh community would take care of their spiritual weapon Brahmastra but as years passed by with changing times people started to forget about it. In present day Shiva a DJ has strange connection with fire which never harms him he meets Isha and both fall in love. A Delhi based scientist Mohan Bhargav from Brahmansh community possess a piece of Brahmastra and gets attacked by two evil forces Zor and Raftaar but he manages to overcome them with powers of Vanarastra but the evil queen Junoon manages to control him and tortures to ask about Brahmastra. But Bhargav being protector of it gives his life which is seen by Shiva in hallucinations after he comes in contact with fire he also notices that next target could be an artist Anish Shetty. Shiva and Isha go to save Anish at Varanasi where he tells him the events he saw but Junoon has already reached there to kill him but Anish manages to escape with Shiva and Isha with power of Nandiastra and asks them to take him to Guruji's Ashram in Himachal. On the way Anish finds who actually is Shiva and gives his piece of Brahmastra to Isha and asks her to reach it safely to Guruji as Junoon is following them who is unaware of Guruji's Ashram. Anish loses his life while fighting with Junoon and her men while after lot of hurdles Shiva and Isha reach Guruji's Ashram where Guruji reveals who actually Shiva is and his connection with fire. And that Brahmastra has three pieces of which one is missing and if Junoon joins them all together the universe will be destroyed.",
    "quality": "HD"
  },
  {
    "movieId": "m009",
    "movie_title": "Sooryavanshi",
    "poster": "https://m.media-amazon.com/images/M/MV5BZGFkZWM2NWYtMjUwYy00YmZjLWE4YjEtODliYjgwMGUwMzM1XkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/u5r77-OQwa8?autoplay=1&si=VBugveiDvBZQUMKo",
    "rating": 6.8,
    "duration": 145,
    "genre": "Action, Thriller",
    "language": "Hindi",
    "release_date": "2021-11-05",
    "synopsis": "A fearless cop takes on a terror group aiming to strike in Mumbai.",
    "storyline":"1993 Mumbai as rocked by 14 back to back blasts which changed the image of city forever Kabir Shroff managed to solve the case within two days but feels guilty that master mind Omar Hafeez and Billal eloped from the city.Omar Hafeez over the years planted many attacks in the country and formed a sleeper cell network lead by his son Riyaz Hafeez.Years later Riyaz's fake identity is traced in Jaisalmer where a team lead by DCP Veer Sooryavanshi goes to arrest him with arrest of Riyaz underworld gets shaken and Omar asks Bilal to return to India.Sooryavanshi finds from Kabir that in 1993 1000 ton RDX came in the city out which 400 ton RDX was used and 600 ton still lies no where and only person who as the idea of this is Bilal.Soorya is going to a tough patch in his personal life as his duty comes first he is very much close to arrest Bilal who commits suicide.Soorya finds that Bilal was in the country after years and also traced missing RDX and met old friend Usmani.Soorya gets a hint that some big attack is going to happen in Mumbai city with activities of Bilal where sleeper cells will be active.In order to save the city two other tough cops Bajirao Singham and Sangram Bhalerao (Simmba) join Soorya in the mission.",
    "quality": "HD"
  },
  {
    "movieId": "m010",
    "movie_title": "Shershaah",
    "poster": "https://m.media-amazon.com/images/M/MV5BZTAzNzg0OGUtZmY1My00Y2VmLTk2YzYtNDU3MjlmNzU5ZjE3XkEyXkFqcGc@._V1_QL75_UY281_CR11,0,190,281_.jpg",
    "trailer": "https://www.youtube.com/embed/Q0FTXnefVBA?autoplay=1&si=8cZdVRCiZLIdiAoJ",
    "rating": 8.4,
    "duration": 135,
    "genre": "War, Drama",
    "language": "Hindi",
    "release_date": "2021-08-12",
    "synopsis": "The inspiring true story of Captain Vikram Batra, a Kargil war hero.",
    "storyline":"Based on the life of Captain Vikram Batra who was an officer of the Indian Army, posthumously awarded with the Param Vir Chakra, India's highest and most prestigious award for valour, for his actions during the 1999 Kargil War in Kashmir between India and Pakistan.",
    "quality": "HD"
  },
  {
    "movieId": "m011",
    "movie_title": "Mimi",
    "poster": "https://m.media-amazon.com/images/M/MV5BYzU5YjkyODYtNmIzOC00MWY3LWE0ZTUtZWU2MDZhODE3NDE1XkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/_sc3HyeNxPs?autoplay=1&si=Pmg9jXHWES3fF8yR",
    "rating": 7.8,
    "duration": 115,
    "genre": "Drama, Comedy",
    "language": "Hindi",
    "release_date": "2021-07-30",
    "synopsis": "A woman agrees to be a surrogate for a foreign couple, but things turn unexpectedly.",
    "storyline":"Mimi (Kriti Sanon) is a small-town girl from Rajasthan who gets offered Rs 20 lakh to act as a surrogate for an American couple. The middleman is Bhanu (Pankaj Tripathi) who, in his impeccable style, manages to convince both parties. The only hindrance being: how Mimi will hide her pregnant belly from her parents and society at large. The film touches upon the challenges of surrogacy and how society looks at it.",
    "quality": "HD"
  },
  {
    "movieId": "m012",
    "movie_title": "The White Tiger",
    "poster": "https://m.media-amazon.com/images/M/MV5BOWUyNDEyMDgtM2IwNy00MTllLWJiMzUtODQ2ODcxZjk4N2ExXkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/7b8it7JPqHE?autoplay=1&si=3Zxbvb69nQOhpiXh",
    "rating": 7.1,
    "duration": 125,
    "genre": "Drama, Thriller",
    "language": "English, Hindi",
    "release_date": "2021-01-22",
    "synopsis": "A poor driver rises to success through cunning and ambition, but with a dark side.",
    "storyline":"Balram Halwai (Adarsh Gourav) narrates his epic and darkly humorous rise from poor villager to successful entrepreneur in modern India. Cunning and ambitious, our young hero jockeys his way into becoming a driver for Ashok (Rajkumar Rao) and Pinky (Priyanka Chopra-Jonas), who have just returned from America. Society has trained Balram to be one thing--a servant--so he makes himself indispensable to his rich masters. But after a night of betrayal, he realizes the corrupt lengths they will go to trap him and save themselves. On the verge of losing everything, Balram rebels against a rigged, unequal system to rise up and become a new kind of master.",
    "quality": "HD"
  },
  {
    "movieId": "m013",
    "movie_title": "Dhamaka",
    "poster": "https://upload.wikimedia.org/wikipedia/en/8/80/Dhamaka_film_poster.jpg",
    "trailer": "https://www.youtube.com/embed/qRESnWFYYho?autoplay=1&si=yEingM4I0gG7sZzh",
    "rating": 7.0,
    "duration": 104,
    "genre": "Thriller, Drama",
    "language": "Hindi",
    "release_date": "2021-11-19",
    "synopsis": "A news anchor gets caught in a terrorist attack while trying to save his career.",
    "storyline":"Arjun Pathak once a prime time news anchor for TRTV go demoted from his position due to unacceptable reasons and now works as an RJ for the same channel for current affairs.Arjun while of air gets a call from Raghubir Matha stating that he will blow the sea link but he takes it as a joke and asks him to go ahead and next moment the sea link is blown killing innocent lives.Arjun does not report about Raghubir to the cops but keeps a demand in front of his boss Ankita Malaskar that he will have to be given his prime time seat back if she wants to air the prime news on her channel.Ankita whose more concerned about her channel ratings strikes deal but Arjun will have to show the news what she wants.Arjun covers the news where Raghubir demands that the Chief Minister should come to his studio and say sorry to him during his live telecast or else there will be more destruction. But Ankita's only priority is to check her TRP ratings where Raghubir causes more destruction where Arjun looses his wife Saumya as well as causes trouble for himself.",
    "quality": "HD"
  },
  {
    "movieId": "m014",
    "movie_title": "The Lost City",
    "poster": "https://m.media-amazon.com/images/M/MV5BZjA4YmZjMWItZGNkNS00ODFkLWEwNjUtNGNhMzViZDRmMzgxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
    "trailer": "https://www.youtube.com/embed/nfKO9rYDmE8?autoplay=1&si=wM4oBjhduv0HkwNj",
    "rating": 6.1,
    "duration": 112,
    "genre": "Action, Adventure, Comedy",
    "language": "English",
    "release_date": "2024-03-02",
    "synopsis": "A writer and a cover model find themselves stranded in a jungle while searching for a lost city of gold, where adventure and danger await.",
    "storyline":"Reclusive author Loretta Sage writes about exotic places in her popular adventure novels that feature a handsome cover model named Alan. While on tour promoting her new book with Alan, Loretta gets kidnapped by an eccentric billionaire who hopes she can lead him to an ancient city's lost treasure from her latest story. Determined to prove he can be a hero in real life and not just on the pages of her books, Alan sets off to rescue her.",
    "quality": "HD"
  },
  {
    "movieId": "m015",
    "movie_title": "Aquaman 2",
    "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Aquaman_and_the_Lost_Kingdom_poster.jpg/220px-Aquaman_and_the_Lost_Kingdom_poster.jpg",
    "trailer": "https://www.youtube.com/embed/UGc5Tzz19UY?autoplay=1&si=Zc7tP58fbYnwqM5s",
    "rating": 7.2,
    "duration": 135,
    "genre": "Action, Adventure, Fantasy",
    "language": "English",
    "release_date": "2024-06-16",
    "synopsis": "Aquaman must confront new threats to Atlantis and the surface world while reconciling his two worlds as the protector of both.",
    "storyline":"Having failed to defeat Aquaman the first time, Black Manta, still driven by the need to avenge his father's death, will stop at nothing to take Aquaman down once and for all. This time Black Manta is more formidable than ever before, wielding the power of the mythic Black Trident, which unleashes an ancient and malevolent force. To defeat him, Aquaman will turn to his imprisoned brother Orm, the former King of Atlantis, to forge an unlikely alliance. Together, they must set aside their differences in order to protect their kingdom and save Aquaman's family, and the world, from irreversible destruction.",
    "quality": "HD"
  },
  {
    "movieId": "m016",
    "movie_title": "The Batman Returns",
    "poster": "https://upload.wikimedia.org/wikipedia/en/e/e9/Batman_The_Dark_Knight_Returns_%28film%29.jpg",
    "trailer": "https://www.youtube.com/embed/EBicn4PqLFY?autoplay=1&si=dx4tZWkxoCkgfn4g",
    "rating": 8.0,
    "duration": 150,
    "genre": "Action, Crime, Thriller",
    "language": "English",
    "release_date": "2024-07-12",
    "synopsis": "Batman faces a new foe in Gotham and must navigate the ever-evolving darkness of his city while grappling with his identity as the Dark Knight.",
    "storyline":"In the sewers of Gotham City to the rooftops of the Gotham City, the Penguin (Danny DeVito) wants to know from where he came. Catwoman (Michelle Pfeiffer) plans to kill rich man of Gotham Max Shreck (Christopher Walken) but as he battles with millionaire Bruce Wayne (Michael Keaton) both ladies' men have their own secrets. Bruce Wayne is back as Batman trying to stop the penguin; Max is helping Penguin steal Gotham City while Selina Kyle/Catwoman tries to help Penguin not knowing her man murder target also her murder is helping him but all four men have their goals taking Gotham from crime-winning Gotham City assassination for two men and more money to be Gotham City's number one rich man.",
    "quality": "4K"
  },
  {
    "movieId": "m017",
    "movie_title": "Fast & Furious 11",
    "poster": "https://m.media-amazon.com/images/M/MV5BMDQxZmM0MDYtYTM1Zi00YmRhLWJkMGEtNjk1MWY3MDUzZDlmXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/emxXFg1_BBI?autoplay=1&si=iEb5Zx_djCe81O4J",
    "rating": 7.5,
    "duration": 130,
    "genre": "Action, Crime, Thriller",
    "language": "English",
    "release_date": "2024-05-01",
    "synopsis": "The Fast & Furious crew faces their toughest adversaries yet while racing across the globe to stop a global conspiracy.",
    "storyline":"Lawman Luke Hobbs and outcast Deckard Shaw form an unlikely alliance when a cyber-genetically enhanced villain threatens the future of humanity.",
    "quality": "HD"
  },
  {
    "movieId": "m018",
    "movie_title": "Guardians of the Galaxy Vol. 3",
    "poster": "https://m.media-amazon.com/images/M/MV5BOTJhOTMxMmItZmE0Ny00MDc3LWEzOGEtOGFkMzY4MWYyZDQ0XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/u3V5KDHRQvk?autoplay=1&si=iriDn788TVrQugf1",
    "rating": 8.2,
    "duration": 150,
    "genre": "Action, Adventure, Comedy",
    "language": "English",
    "release_date": "2024-05-05",
    "synopsis": "The Guardians face new challenges as they navigate a dangerous galaxy while dealing with their own personal struggles.",
    "storyline":"In Marvel Studios 'Guardians of the Galaxy Vol. 3' our beloved band of misfits are looking a bit different these days. Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.",
    "quality": "HD"
  },
  {
    "movieId": "m019",
    "movie_title": "Spider-Man: Beyond the Spider-Verse",
    "poster": "https://m.media-amazon.com/images/M/MV5BZGZhMmE5OTYtMjM3Ny00NTVmLTgwZmEtZDY4YmE3MzQwN2ViXkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/CPV0--fgbbw?autoplay=1&si=Eu4iWadxBUNbBIEc",
    "rating": 9.0,
    "duration": 140,
    "genre": "Animation, Action, Adventure",
    "language": "English",
    "release_date": "2024-07-25",
    "synopsis": "Spider-Man teams up with his multiverse counterparts to stop an even greater threat to the Spider-Verse.",
    "storyline":"Taking place right after the events of Spider-Man: Across the Spider-Verse, Gwen Stacy leads the newly reformed Spider-Gang in a race against the Spider-Society, led by Miguel O'Hara, to find Miles Morales, who is trapped in the home dimension of the spider that bit him, along with an alternate version of himself as the Prowler, while the Spot begins his deadly attack in his dimension with far-reaching multiverse consequences.",
    "quality": "4K"
  },
  {
    "movieId": "m020",
    "movie_title": "Mission: Impossible 8",
    "poster": "https://image.tmdb.org/t/p/original/mRhEg5hBCSi2aOdercqLC3AmT0A.jpg",
    "trailer": "https://www.youtube.com/embed/NOhDyUmT9z0?autoplay=1&si=gQOfNsHsNnXC7i3R",
    "rating": 7.8,
    "duration": 145,
    "genre": "Action, Adventure, Thriller",
    "language": "English",
    "release_date": "2024-08-10",
    "synopsis": "Ethan Hunt faces his most dangerous mission yet as he attempts to stop a global crisis while dealing with his own inner demons.",
    "storyline":"The 8th entry in the long running Mission Impossible franchise.",
    "quality": "HD"
  },
  {
    "movieId": "m021",
    "movie_title": "Dune: Part Two",
    "poster": "https://m.media-amazon.com/images/M/MV5BNTc0YmQxMjEtODI5MC00NjFiLTlkMWUtOGQ5NjFmYWUyZGJhXkEyXkFqcGc@._V1_.jpg",
    "trailer": "https://www.youtube.com/embed/Way9Dexny3w?autoplay=1&si=ufNIOWys_pbOVq9t",
    "rating": 8.2,
    "duration": 155,
    "genre": "Sci-Fi, Adventure, Drama",
    "language": "English",
    "release_date": "2024-10-18",
    "synopsis": "The epic continuation of Paul Atreides' journey as he seeks revenge and tries to avoid a future of destruction.",
    "storyline":"Paul Atreides unites with Chani and the Fremen while on a warpath of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee.",
    "quality": "HD"
  },
  {
    "movieId": "m022",
    "movie_title": "Deadpool 3",
    "poster": "https://images.news18.com/webstories/uploads/2024/07/MV5BNzRiMjg0MzUtNTQ1Mi00Y2Q5LWEwM2MtMzUwZDU5NmVjN2NkXkEyXkFqcGc@._V1_-2024-07-30116fb4119c24596ac59e988714df6a.jpg",
    "trailer": "https://www.youtube.com/embed/73_1biulkYk?autoplay=1&si=0tncZq7Nch3ZDL1T",
    "rating": 7.5,
    "duration": 110,
    "genre": "Action, Comedy, Superhero",
    "language": "English",
    "release_date": "2024-11-01",
    "synopsis": "Deadpool teams up with the multiverse's most unlikely allies to face a dangerous new threat while breaking the fourth wall.",
    "storyline":"A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
    "quality": "HD"
  },
  {
    "movieId": "m023",
    "movie_title": "The Marvels",
    "poster": "https://lumiere-a.akamaihd.net/v1/images/p_disneyplusoriginals_themarvels_poster_rebrand_8c17eea5.jpeg",
    "trailer": "https://www.youtube.com/embed/wS_qbDztgVY?autoplay=1&si=fvU31QV-JjZgTmIu",
    "rating": 6.9,
    "duration": 120,
    "genre": "Action, Adventure, Sci-Fi",
    "language": "English",
    "release_date": "2024-07-19",
    "synopsis": "Carol Danvers, Kamala Khan, and Monica Rambeau are brought together by a cosmic anomaly, forced to work as a team against an emerging threat.",
    "storyline":"Carol Danvers AKA Captain Marvel has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan Kamala Khan, aka Ms. Marvel, and Carol's estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau.",
    "quality": "HD"
  },
  {
    "movieId": "m024",
    "movie_title": "Joker: Folie à Deux",
    "poster": "https://m.media-amazon.com/images/M/MV5BNTRlNmU1NzEtODNkNC00ZGM3LWFmNzQtMjBlMWRiYTcyMGRhXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/_OKAwz2MsJs?autoplay=1&si=1lyTpguJfguxZ4tA",
    "rating": 8.4,
    "duration": 130,
    "genre": "Crime, Drama, Thriller",
    "language": "English",
    "release_date": "2024-10-04",
    "synopsis": "Arthur Fleck and his mysterious accomplice Harley Quinn spiral further into madness, leading to an explosive confrontation that will reshape Gotham forever.",
    "storyline":"Struggling with his dual identity, failed comedian Arthur Fleck meets the love of his life, Harley Quinn, while incarcerated at Arkham State Hospital.",
    "quality": "HD"
  },
  {
    "movieId": "m025",
    "movie_title": "The Hunger Games: The Ballad of Songbirds & Snakes",
    "poster": "https://m.media-amazon.com/images/M/MV5BZDk2YjNhYzEtYzg2ZC00OWEwLWJhYzgtMGUzMWVjNDFmYzI5XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer": "https://www.youtube.com/embed/RDE6Uz73A7g?autoplay=1&si=9mgwMTuiK8BgTNzF",
    "rating": 7.7,
    "duration": 157,
    "genre": "Action, Adventure, Drama",
    "language": "English",
    "release_date": "2024-11-17",
    "synopsis": "Set years before Katniss Everdeen, young Coriolanus Snow finds himself involved in the creation of the first Hunger Games as a mentor to a tribute from District 12.",
    "storyline":"The story of Coriolanus Snow, years before he would become the tyrannical President of Panem. He is young, very determined and though the Snow family has fallen on hard times, Coriolanus sees a chance for a change in his fortunes when he is chosen to be a mentor for the 10th Hunger Games only to have his elation dashed when he is assigned to mentor a girl tribute named Lucy Gray Baird from the impoverished District 12.",
    "quality": "HD"
  },
  {
    "movieId": "m026",
    "movie_title": "Aquaman and the Lost Kingdom",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSF0NoQyOCf3rsz6Nvb-zxmffTdsWnLDpnViQ&s",
    "trailer": "https://www.youtube.com/embed/UGc5Tzz19UY?autoplay=1&si=PISxPAdgelhfYeSQ",
    "rating": 7.2,
    "duration": 125,
    "genre": "Action, Adventure, Fantasy",
    "language": "English",
    "release_date": "2024-12-20",
    "synopsis": "Aquaman must face new threats from both land and sea to save Atlantis and protect his family from an ancient evil force.",
    "storyline":"Having failed to defeat Aquaman the first time, Black Manta, still driven by the need to avenge his father's death, will stop at nothing to take Aquaman down once and for all. This time Black Manta is more formidable than ever before, wielding the power of the mythic Black Trident, which unleashes an ancient and malevolent force. To defeat him, Aquaman will turn to his imprisoned brother Orm, the former King of Atlantis, to forge an unlikely alliance. Together, they must set aside their differences in order to protect their kingdom and save Aquaman's family, and the world, from irreversible destruction.",
    "quality": "HD"
  },
  {
    "movieId": "m027",
    "movie_title": "Wonka",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ4fzKn2EaTyzRIPNprPRMh6nFptWKsDgOoAw&s",
    "trailer": "https://www.youtube.com/embed/otNh9bTjXWg?autoplay=1&si=PQ2BDxjHH0_HbOa7",
    "rating": 6.5,
    "duration": 112,
    "genre": "Family, Fantasy, Adventure",
    "language": "English",
    "release_date": "2024-12-15",
    "synopsis": "A young Willy Wonka embarks on an adventurous journey to discover the magic behind chocolate-making, leading to the creation of his famous chocolate factory.",
    "storyline":"Willy Wonka is the mastermind behind some of the most delicious and innovative chocolate creations the world has ever seen. But before shaking up the chocolate industry and making a name for himself as a confectionery genius, the ambitious young creator had to defy all odds. As a result, Willy transformed his wildest dreams into reality with a bold vision, determination, and unexpected help from new friends. After all, hard work and a dash of magic can make anything happen. Because, as Willy already knows, it only takes a dream to make a difference.",
    "quality": "HD"
  },
  {
    "movieId": "m028",
    "movie_title": "The Flash 2",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhQKA9NOoH349IAi4klF-1s34OvGW-Zl0p_Q&s",
    "trailer": "https://www.youtube.com/embed/75DM20UXuxc?autoplay=1&si=vD3wPGNt4vt_411h",
    "rating": 7.4,
    "duration": 140,
    "genre": "Action, Adventure, Sci-Fi",
    "language": "English",
    "release_date": "2025-01-10",
    "synopsis": "The Flash races against time to prevent a new multiversal disaster, but an even greater threat looms that may destroy all timelines.",
    "storyline":"Barry Allen is struck by a bolt of lightning and thus, an extraordinary power is born inside him: The Speed Force. When he uses this power to run back in time and save his mother, he creates a world without heroes and General Zod has returned. To defeat him, his only hope rests in the hands of a retired Batman, another Barry and an imprisoned kryptonian.",
    "quality": "HD"
  },
  {
    "movieId": "m029",
    "movie_title": "Transformers: Rise of the Beasts 2",
    "poster": "https://upload.wikimedia.org/wikipedia/en/1/1c/Transformers-_Rise_of_the_Beasts.jpg",
    "trailer": "https://www.youtube.com/embed/itnqEauWQZM?autoplay=1&si=YjJb61Sgd0ILx8TC",
    "rating": 6.8,
    "duration": 150,
    "genre": "Action, Adventure, Sci-Fi",
    "language": "English",
    "release_date": "2025-06-20",
    "synopsis": "The Autobots and Maximals must join forces to stop the Decepticons, who have allied with an ancient alien race to conquer Earth.",
    "storyline":"Returning to the action and spectacle that have captured moviegoers around the world, Transformers: Rise of the Beasts will take audiences on a '90s globetrotting adventure with the Autobots and introduce a whole new faction of Transformers - the Maximals - to join them as allies in the existing battle for earth. Directed by Steven Caple Jr. and starring Anthony Ramos and Dominique Fishback.",
    "quality": "HD"
  },
  {
    "movieId": "m030",
    "movie_title": "Indiana Jones and the Dial of Destiny 2",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSD1gLcJ_GOnEtF0_I1sxwvLPBLWS7HWemZpg&s",
    "trailer": "https://www.youtube.com/embed/eQfMbSe7F2g?autoplay=1&si=pDg59EFo6aBepuz8",
    "rating": 7.3,
    "duration": 160,
    "genre": "Action, Adventure",
    "language": "English",
    "release_date": "2025-07-03",
    "synopsis": "Indiana Jones and his allies embark on a thrilling global journey to recover a lost artifact that could change history forever.",
    "storyline":"Experience the return of legendary hero, Indiana Jones, in the fifth installment of this beloved swashbuckling series of films. Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands.",
    "quality": "HD"
  },
  {
    "movieId": "m031",
    "movie_title": "Blade: Rebirth",
    "poster": "https://m.media-amazon.com/images/I/71+lJC9DHQL.jpg",
    "trailer": "https://www.youtube.com/embed/jiHeMULoS48?autoplay=1&si=KAJF2IB2dDN6bLlt",
    "rating": 7.9,
    "duration": 130,
    "genre": "Action, Horror, Superhero",
    "language": "English",
    "release_date": "2025-08-01",
    "synopsis": "Blade returns to face a new breed of vampire who threatens not only his world but the very fabric of reality.",
    "storyline":"A rare mutation has occurred within the vampire community. The Reaper. A vampire so consumed with an insatiable bloodlust that they prey on vampires as well as humans, transforming victims who are unlucky enough to survive into Reapers themselves. Now their quickly expanding population threatens the existence of vampires, and soon there won't be enough humans in the world to satisfy their bloodlust. Blade, Whistler and an armory expert named Scud are curiously summoned by the Shadow Council. The council reluctantly admits that they are in a dire situation and they require Blade's assistance. Blade then tenuously enters into an alliance with The Bloodpack, an elite team of vampires trained in all modes of combat to defeat the Reaper threat. Blade's team and the Bloodpack are the only line of defense which can prevent the Reaper population from wiping out the vampire and human populations.",
    "quality": "HD"
  },
  {
    "movieId": "m032",
    "movie_title": "Mission: Impossible 9",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTCraxBczbqGKk-RAgmLhbMC2wEb1Ayjll5Pw&s",
    "trailer": "https://www.youtube.com/embed/NOhDyUmT9z0?autoplay=1&si=hUAKzAIt1U1nS8sm",
    "rating": 8.0,
    "duration": 150,
    "genre": "Action, Thriller, Adventure",
    "language": "English",
    "release_date": "2025-09-19",
    "synopsis": "Ethan Hunt faces an unprecedented international conspiracy that threatens global peace, pushing him to the limits of his endurance and loyalty.",
    "storyline":"Ethan Hunt and the IMF team must track down a terrifying new weapon that threatens all of humanity if it falls into the wrong hands. With control of the future and the fate of the world at stake, a deadly race around the globe begins. Confronted by a mysterious, all-powerful enemy, Ethan is forced to consider that nothing can matter more than the mission -- not even the lives of those he cares about most.",
    "quality":"HD"
  }]